import pandas as pd

# qs = pd.read_csv('csv/m_concat.csv', low_memory=False)
# total_amount = qs['請求金額'].sum()
# course_sum = qs.groupby('処方コース')['請求金額'].sum()

qs = pd.read_csv('csv/m_python.csv', low_memory=False)
total_amount = qs['請求金額_raw'].sum()
course_sum = qs.groupby('処方コース')[['請求金額_raw','GMV診察代_税込','GMV診察代_税抜','値引特典_税込','値引特典_税抜']].sum()

print("請求金額の合計:", total_amount)
# 13379344127
print("処方コースごとの請求金額の合計:")
print(course_sum)

#               請求金額_raw   値引クーポン_税込    GMV診察代_税込
# 処方コース
# 1ヶ月          539009152    110140.0    5050500.0  # 違う
# 3ヶ月          570439044         0.0          0.0
# その他           17911455    703900.0     528000.0
# その他（感染症）         17700         0.0          0.0
# クロスセル          3498710    145500.0    1369500.0
# ダイエット単発1ヶ月      649860     51500.0      90000.0
# ダイエット定期1ヶ月     4781160    383000.0      97500.0  # 違う
# ダイエット定期3ヶ月      832240     18500.0       3000.0
# 中用量          615834820  11879050.0  145872000.0
# 安心定期        3153249851         0.0          0.0
# 安心定期12ヶ月    2596322840  30728270.0   59140500.0  # 違う
# 安心定期1ヶ月     2360872749   7996770.0  103660500.0  # 違う
# 安心定期3ヶ月     1308111318   9501800.0   52282500.0   # 違う
# 特典                   0         0.0          0.0
# 緊急避妊        1733879488   2961200.0  119676000.0
# 診察代          473933740  13001060.0          0.0

# python処理後、230行
#               請求金額_raw    GMV診察代_税込  GMV診察代_税抜   値引特典_税込   値引特典_税抜
# 処方コース
# 1ヶ月          539009152    5052000.0    4590584      1500      1363
# 3ヶ月          570439044          0.0          0         0         0
# その他           17911455     528000.0     479776         0         0
# その他（感染症）         17700          0.0          0         0         0
# クロスセル          3498710    1369500.0    1244419         0         0
# ダイエット単発1ヶ月      649860      90000.0      81780         0         0
# ダイエット定期1ヶ月     4781160     424500.0     385729    327000    297134
# ダイエット定期3ヶ月      832240      31500.0      28623     28500     25897
# 中用量          615834820  145872000.0  132549024         0         0
# 安心定期        3153249851          0.0          0         0         0
# 安心定期12ヶ月    2596322840  156091500.0  141835143  96951000  88096142
# 安心定期1ヶ月     2360872749  182394000.0  165735348  78733500  71542507
# 安心定期3ヶ月     1308111318   83698500.0   76054037  31416000  28546672
# 特典                   0          0.0          0         0         0
# 緊急避妊        1733879488  119676000.0  108745592         0         0
# 診察代          473933740          0.0          0         0         0

row_count = len(qs)
print("データの行数:", row_count)
# 2753408


# # 上から1行を取得
# first_row = qs.iloc[0]
# print("CSVの上から1行目:")
# print(first_row)
